In [19]:
import pandas as pd
import re
from dateutil.parser import parse
import datetime

In [20]:
gps = pd.read_csv("../assignment2/gps.csv", encoding='cp1252')

In [21]:
gps.shape

(685169, 4)

In [22]:
gps["Timestamp"] = gps.apply(lambda x:datetime.datetime.strptime(x["Timestamp"], '%m/%d/%Y %H:%M:%S').strftime('%m/%d/%Y %H:%M') , axis=1)

In [23]:
locations_by_minute = gps.groupby(["Timestamp","id"]).agg("mean").reset_index()
locations_by_minute["date"] = locations_by_minute.apply(lambda x:datetime.datetime.strptime(x["Timestamp"], '%m/%d/%Y %H:%M').strftime('%m/%d/%Y') , axis=1)

In [24]:
locations_by_minute

              Timestamp  id        lat       long        date
0      01/06/2014 06:28  35  36.074791  24.873310  01/06/2014
1      01/06/2014 06:29  35  36.071204  24.871683  01/06/2014
2      01/06/2014 06:30  35  36.067808  24.872183  01/06/2014
3      01/06/2014 06:33   4  36.076730  24.870998  01/06/2014
4      01/06/2014 06:33  35  36.067537  24.873311  01/06/2014
...                 ...  ..        ...        ...         ...
18792  01/19/2014 20:37  18  36.062023  24.898618  01/19/2014
18793  01/19/2014 20:37  24  36.059945  24.899694  01/19/2014
18794  01/19/2014 20:38  18  36.063314  24.896112  01/19/2014
18795  01/19/2014 20:38  24  36.061793  24.898635  01/19/2014
18796  01/19/2014 20:56  30  36.057235  24.902205  01/19/2014

[18797 rows x 5 columns]

In [25]:
locations_by_minute.to_csv("../data/locations_by_minute.csv")